In [30]:
import pandas as pd
import sqlalchemy
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: jovyan@si330'

In [31]:
!psql -f datasets/finalexam.sql -U jovyan -d si330

SET
SET
SET
SET
SET
 set_config
------------

(1 row)

SET
SET
SET
CREATE EXTENSION
COMMENT
SET
SET
psql:datasets/finalexam.sql:40: ERROR:  relation "customers" already exists
psql:datasets/finalexam.sql:52: ERROR:  relation "orderdetails" already exists
psql:datasets/finalexam.sql:72: ERROR:  relation "orders" already exists
psql:datasets/finalexam.sql:88: ERROR:  relation "products" already exists
psql:datasets/finalexam.sql:97: ERROR:  relation "shippers" already exists
psql:datasets/finalexam.sql:108: ERROR:  relation "supplier" already exists
COPY 91
COPY 2820
COPY 1078
COPY 77
COPY 3
COPY 15

In [32]:
%%sql
SELECT * FROM public.customers LIMIT 5;

 * postgres://jovyan:***@localhost:5432/si330
5 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', '', '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', '', '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', '', '05023', 'Mexico', '(5) 555-3932', ''),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', '', 'WA1 1DP', 'UK', '(71) 555-7788', '(71) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', '', 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

In [47]:
%%sql

DROP TABLE IF EXISTS bikinibottom;

CREATE TABLE bikinibottom (
    character varchar(255),
    place varchar(255),
    age integer,
    color varchar(255)
);

CREATE TABLE 

INSERT INTO bikinibottom (character, place, age, color) VALUES ('Spongebob Square', 'Pineapple', 13, 'Yellow');
INSERT INTO bikinibottom (character, place, age, color) VALUES ('Patrick', 'Rock', 13, 'Pink');
INSERT INTO bikinibottom (character, place, age, color) VALUES ('Squidward', 'Stonehead', 46, 'Blue');
INSERT INTO bikinibottom (character, place, age, color) VALUES ('Mr. Krabs', 'Krusty Krabs', 60, 'Red');
INSERT INTO bikinibottom (character, place, age, color) VALUES ('Sandy', 'Dome', 16, 'Brown');

SELECT * FROM bikinibottom

 * postgres://jovyan:***@localhost:5432/si330
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[('Spongebob Square', 'Pineapple', 13, 'Yellow'),
 ('Patrick', 'Rock', 13, 'Pink'),
 ('Squidward', 'Stonehead', 46, 'Blue'),
 ('Mr. Krabs', 'Krusty Krabs', 60, 'Red'),
 ('Sandy', 'Dome', 16, 'Brown')]

In [45]:
%%sql
select * FROM public.customers LIMIT 3;

 * postgres://jovyan:***@localhost:5432/si330
3 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', '', '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', '', '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', '', '05023', 'Mexico', '(5) 555-3932', '')]

In [72]:
%%sql
SELECT COUNT(contactname) AS count_contact 
FROM public.customers
GROUP BY count_contact
ORDER BY count_contact;

 * postgres://jovyan:***@localhost:5432/si330
(psycopg2.errors.GroupingError) aggregate functions are not allowed in GROUP BY
LINE 1: SELECT COUNT(contactname) AS count_contact
               ^

[SQL: SELECT COUNT(contactname) AS count_contact
FROM public.customers
GROUP BY count_contact
ORDER BY count_contact;]
(Background on this error at: http://sqlalche.me/e/13/f405)